БИТУправление_медицинским_центром_демо/src/Catalogs/ПереченьВредныхФакторовИРабот/ПереченьВредныхФакторовИРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПереченьВредныхФакторовИРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбязательныеДействия29н</name>
      <description>Обязательные действия 29н</description>
    </items>
    <items>
      <name>ОбязательныеДействия302н</name>
      <description>Обязательные действия 302н</description>
    </items>
    <items>
      <name>ОбязательныеДействия342н</name>
      <description>Обязательные действия 342н</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречняДляМедОсмотра</name>
    <type>
      <types>EnumRef.ВидыПеречняДляМедОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерППДляСортировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрачиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛабораторныеИФункциональныеИсследованияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрокаДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОсмотров</name>
    <type>
      <types>CatalogRef.ПериодичностьОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВредноеВещество</name>
    <type>
      <types>CatalogRef.ВредныеВещества</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППиПриказа_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерПП_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППДляСортировки_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>CatalogRef.ПриказыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОсмотраСправки</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Врачи</name>
    <attributes>
      <name>Врач</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛабораторныеИФункциональныеИсследования</name>
    <attributes>
      <name>Исследование</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МедицинскиеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыВредныхВеществ</name>
    <attributes>
      <name>ГруппаВредныхВеществ</name>
      <type>
        <types>EnumRef.ГруппыОпасныхВеществ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПереченьВредныхФакторовИРабот/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыполнитьСтандартноеПолучениеДанныхВыбора") Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
		
		Если Не Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
			Параметры.Отбор.Вставить("ПометкаУдаления",Ложь);
		КонецЕсли;
		
		Параметры.Вставить("ВыполнитьСтандартноеПолучениеДанныхВыбора");
		ДанныеВыбора = Справочники.ПереченьВредныхФакторовИРабот.ПолучитьДанныеВыбора(Параметры);
		
		Если ДанныеВыбора.Количество() <> 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ДанныеВыбора);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПереченьВредныхФакторовИРабот.Ссылка КАК Ссылка,
			|	ПереченьВредныхФакторовИРабот.Приказ.Код КАК ПриказКод,
			|	ПереченьВредныхФакторовИРабот.Наименование КАК Наименование,
			|	ПереченьВредныхФакторовИРабот.НомерПП КАК НомерПП
			|ИЗ
			|	Справочник.ПереченьВредныхФакторовИРабот КАК ПереченьВредныхФакторовИРабот
			|ГДЕ
			|	ПереченьВредныхФакторовИРабот.Ссылка В(&Ссылка)";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.НомерПП) Тогда
					Представление = СокрЛП(Выборка.НомерПП) + " (" + СокрЛП(Выборка.ПриказКод) +")"; 
				Иначе
					Представление = Выборка.Наименование; 
				КонецЕсли;
				
				ЭлементСписка = ДанныеВыбора.НайтиПоЗначению(Выборка.Ссылка);
				ЭлементСписка.Представление = Представление;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
